# GetCoupledReinforcementData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCoupler..::..GetCoupledReinforcementData Method
RebarCoupler Class See Also
---
gets the reinforcement data. The returned list will have size = 2. If coupler stays on only one bar one element in this list will be null.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<ReinforcementData> GetCoupledReinforcementData()
```

Visual Basic
---
```text
Public Function GetCoupledReinforcementData As IList(Of ReinforcementData)
```

Visual C++
---
```text
public:
IList<ReinforcementData^>^ GetCoupledReinforcementData()
```

# See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace